# OwnedByOther Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..EditingFailures..::..OwnedByOther Property
BuiltInFailures..::..EditingFailures Class See Also
---
Can't edit the element until '[Partition Name]' resaves the element to central and relinquishes it and you Reload Latest.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId OwnedByOther { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property OwnedByOther As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ OwnedByOther {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..EditingFailures Class
Autodesk.Revit.DB Namespace